glcloud/keil_v5/ARM/PACK/.Web/Holtek.HT32_DFP.pdsc
        <device Dname="HT32F1755_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1755_64LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F1755_100LQFP">
          <!--<compile    define="USE_MEM_HT32F1755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x8000"     init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F1765">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="48" name="48QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F1765_48QFN">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFN" n="48" name="QFN"/>
        </device>
        <device Dname="HT32F1765_48LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F1765_64LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F1765_100LQFP">
          <!--<compile    define="USE_MEM_HT32F1765"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F2755">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="48" name="48QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F2755_48QFN">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFN" n="48" name="QFN"/>
        </device>
        <device Dname="HT32F2755_48LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="33"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F2755_64LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="47"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F2755_100LQFP">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F2755"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
      </subFamily>
    </family>

  <!-- ************************  Series 'HT32F522xx'  **************************** -->
    <family Dfamily="HT32F522xx Series" Dvendor="Holtek:106">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="0" Dmpu="0" Dendian="Little-endian" Dclock="40000000" />
      <description>
The HOLTEK HT32F522xx devices are high performance, low power consumption 32-bit microcontrollers based around an ARM Cortex-M0+ processor core. The Cortex-M0+ is a next-generation processor core which is tightly coupled with Nested Vectored Interrupt Controller (NVIC), SysTick timer and including advanced debug support.

The devices operate at a frequency of up to 40 MHz for HT32F522xx with a Flash accelerator to obtain maximum efficiency. It provides up to 128 KB of embedded Flash memory for code/data storage and 16 KB of embedded SRAM memory for system operation and application program usage. A variety of peripherals, such as ADC, DIV, PDMA, I2C, USART, UART, SPI, MCTM, GPTM, SCTM, CRC-16/32, RTC, WDT, SW-DP (Serial Wire Debug Port), etc., are also implemented in the device series. Several power saving modes provide the flexibility for maximum optimization between wakeup latency and power consumption, an especially important consideration in low power applications.

The above features ensure that the devices are suitable for use in a wide range of applications, especially in areas such as white goods application control, power monitors, alarm systems, consumer products, handheld equipment, data logging applications, motor control and so on.
      </description>
      <subFamily DsubFamily="HT32F52220/52230">
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F52220_30"/>
        <debug      svd="SVD/HT32F52220_30.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.00"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="ADC"         n="8"           m="12"/>
        <feature type="Timer"       n="1"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="WDT"         n="1"/>
        <feature type="USART"       n="1"/>
        <feature type="UART"        n="1"/>
        <feature type="SPI"         n="1"/>
        <feature type="I2C"         n="1"/>
        <device Dname="HT32F52220">
          <!--<compile    define="USE_MEM_HT32F52220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="23"/>
          <feature type="SOP" n="24" name="24SSOP"/>
          <feature type="SOP" n="28" name="28SSOP"/>
          <feature type="QFN" n="33" name="33QFN"/>
        </device>
        <device Dname="HT32F52220_24SSOP">
          <!--<compile    define="USE_MEM_HT32F52220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="19"/>
          <feature type="SOP" n="24" name="SSOP"/>
        </device>
        <device Dname="HT32F52220_28SSOP">
          <!--<compile    define="USE_MEM_HT32F52220"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x4000"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x1000"     init   ="0"   default="1"/>
          <feature type="IOs" n="23"/>
          <feature type="SOP" n="28" name="SSOP"/>
        </device>
