glcloud/keil_v5/ARM/PACK/.Web/Holtek.HT32_DFP.pdsc
        <device Dname="HT32F52341_33QFN">
          <!--<compile    define="USE_MEM_HT32F52341"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFE00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="24"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52341_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52341"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFE00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="38"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
      </subFamily>

      <subFamily DsubFamily="HT32F52342/52352">
      <processor Dclock="48000000"/>
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F52342_52"/>
        <debug      svd="SVD/HT32F52342_52.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.00"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="AnalogOther" n="2"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="2"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="ComOther"    n="2"                               name="SCI"/>
        <feature type="USBD"        n="1"/>
        <feature type="ExtBus"      n="16"                              name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="USART"       n="2"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <device Dname="HT32F52342">
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F52342_33QFN">
          <!--<compile    define="USE_MEM_HT32F52342"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52342_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52342"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="39"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52342_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52342"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F52352">
          <!--<compile    define="USE_MEM_HT32F52352"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F52352_33QFN">
          <!--<compile    define="USE_MEM_HT32F52352"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52352_48LQFP">
          <!--<compile    define="USE_MEM_HT32F52352"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="39"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F52352_64LQFP">
          <!--<compile    define="USE_MEM_HT32F52352"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x1FE00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
      </subFamily>

      <subFamily DsubFamily="HT32F52344/52354">
      <processor Dclock="60000000"/>
        <compile    header="ARM/INC/Holtek/HT32F5xxxx/ht32f5xxxx_01.h"/>
        <compile    define="USE_HT32F52344_54"/>
        <debug      svd="SVD/HT32F52344_54.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x0400"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="1.65"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="6"                               name="Peripheral DMA"/>
        <feature type="ADC"         n="12"          m="12"/>
        <feature type="AnalogOther" n="2"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="SCTM with single PWM"/>
        <feature type="Timer"       n="1"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="1"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="USBD"        n="1"/>
        <feature type="ExtBus"      n="16"                              name="EBI"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="1"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="DIV"/>
        <device Dname="HT32F52344">
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFN" n="33" name="33QFN"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
        </device>
        <device Dname="HT32F52344_33QFN">
          <!--<compile    define="USE_MEM_HT32F52344"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="26"/>
          <feature type="QFN" n="33" name="QFN"/>
        </device>
        <device Dname="HT32F52344_46QFN">
          <!--<compile    define="USE_MEM_HT32F52344"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x10000"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x2000"     init   ="0"   default="1"/>
          <feature type="IOs" n="38"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
