glcloud/keil_v5/ARM/PACK/.Web/Holtek.HT32_DFP.pdsc
        <device Dname="HT32F12345_64LQFP">
          <!--<compile    define="USE_MEM_HT32F12345"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0xFC00"     startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x4000"     init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
      </subFamily>

      <subFamily DsubFamily="HT32F12365/12366/22366">
        <compile    header="ARM/INC/Holtek/HT32F1xxxx/ht32f1xxxx_01.h"/>
        <compile    define="USE_HT32F12365_66"/>
        <debug      svd="SVD/HT32F12365_66.svd"/>
        <algorithm  name="ARM/Flash/HT32F.FLM"      start="0x00000000"  size="0x100000"                 default="1"/>
        <algorithm  name="ARM/Flash/HT32F_OPT.FLM"  start="0x1FF00000"  size="0x1000"                   default="1"/>
        <feature type="XTAL"        n="4000000"     m="16000000"/>
        <feature type="IntRC"       n="8000000"/>
        <feature type="RTC"         n="32768"/>
        <feature type="VCC"         n="2.00"        m="3.60"/>
        <feature type="Temp"        n="-40"         m="85"/>
        <feature type="PowerMode"   n="5"                               name="Run,Sleep,Deep-Sleep1,Deep-Sleep2,Power-Down"/>
        <feature type="ExtInt"      n="16"/>
        <feature type="DMA"         n="12"                              name="Peripheral DMA"/>
        <feature type="ADC"         n="16"          m="12"/>
        <feature type="AnalogOther" n="2"                               name="Comparator"/>
        <feature type="Timer"       n="2"           m="32"              name="BFTM"/>
        <feature type="Timer"       n="2"           m="16"              name="GPTM with Quadrature Decoder"/>
        <feature type="Timer"       n="2"           m="16"              name="MCTM with Complementary Outputs"/>
        <feature type="WDT"         n="1"/>
        <feature type="ComOther"    n="2"                               name="SCI"/>
        <feature type="USBD"        n="1"/>
        <feature type="ExtBus"      n="16"                              name="EBI"/>
        <feature type="I2S"         n="1"/>
        <feature type="SDIO"        n="1"           m="4"/>
        <feature type="USART"       n="2"/>
        <feature type="UART"        n="2"/>
        <feature type="SPI"         n="2"/>
        <feature type="I2C"         n="2"/>
        <feature type="Other"       n="1"                               name="CRC"/>
        <feature type="Other"       n="1"                               name="AES"/>
        <device Dname="HT32F12365">
          <!--<compile    define="USE_MEM_HT32F12365"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F12365_46QFN">
          <!--<compile    define="USE_MEM_HT32F12365"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F12365_48LQFP">
          <!--<compile    define="USE_MEM_HT32F12365"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F12365_64LQFP">
          <!--<compile    define="USE_MEM_HT32F12365"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F12365_100LQFP">
          <!--<compile    define="USE_MEM_HT32F12365"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x10000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F12366">
          <!--<compile    define="USE_MEM_HT32F12366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F12366_46QFN">
          <!--<compile    define="USE_MEM_HT32F12366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
        <device Dname="HT32F12366_48LQFP">
          <!--<compile    define="USE_MEM_HT32F12366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFP" n="48" name="LQFP"/>
        </device>
        <device Dname="HT32F12366_64LQFP">
          <!--<compile    define="USE_MEM_HT32F12366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="51"/>
          <feature type="QFP" n="64" name="LQFP"/>
        </device>
        <device Dname="HT32F12366_100LQFP">
          <!--<compile    define="USE_MEM_HT32F12366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFP" n="100" name="LQFP"/>
        </device>
        <device Dname="HT32F22366">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F22366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="80"/>
          <feature type="QFN" n="46" name="46QFN"/>
          <feature type="QFP" n="48" name="48LQFP"/>
          <feature type="QFP" n="64" name="64LQFP"/>
          <feature type="QFP" n="100" name="100LQFP"/>
        </device>
        <device Dname="HT32F22366_46QFN">
          <feature type="ComOther"    n="1"                               name="CSIF"/>
          <!--<compile    define="USE_MEM_HT32F22366"/>-->
          <memory     id="IROM1"                      start="0x00000000"  size="0x3FC00"    startup="1"   default="1"/>
          <memory     id="IRAM1"                      start="0x20000000"  size="0x20000"    init   ="0"   default="1"/>
          <feature type="IOs" n="37"/>
          <feature type="QFN" n="46" name="QFN"/>
        </device>
