glcloud/keil_v5/ARM/PACK/.Web/Holtek.HT32_DFP.pdsc
    <condition id="HT32F52220_30">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[23]0*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52231_41">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52243_53">
      <description>Holtek Cortex-M0+ Standard MCU Value Line</description>
      <accept Dname="HT32F522[45]3*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52331_41">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52342_52">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[45]2*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F12345">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F12345*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F12365_66">
      <description>Holtek Cortex-M3 Standard MCU</description>
      <accept Dname="HT32F1236[56]*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F22366">
      <description>Holtek Cortex-M3 Special-Purpose MCU</description>
      <accept Dname="HT32F22366*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F5826">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F5826*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F0008">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F0008*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F0006">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F0006*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F50220_30">
      <description>Holtek Cortex-M0+ 5V Tolerant MCU</description>
      <accept Dname="HT32F502[23]0*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F50231_41">
      <description>Holtek Cortex-M0+ 5V Tolerant MCU</description>
      <accept Dname="HT32F502[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52344_54">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[45]4*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F65240">
      <description>Holtek Cortex-M0+ Special-Purpose MCU</description>
      <accept Dname="HT32F65240*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F52357_67">
      <description>Holtek Cortex-M0+ Standard MCU USB Line</description>
      <accept Dname="HT32F523[56]7*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F57331_41">
      <description>Holtek Cortex-M0+ Standard MCU LCD Line</description>
      <accept Dname="HT32F573[34]1*"/>
      <require condition="Compiler ARM"/>
    </condition>

    <condition id="HT32F57342_52">
      <description>Holtek Cortex-M0+ Standard MCU LCD Line</description>
      <accept Dname="HT32F573[45]2*"/>
      <require condition="Compiler ARM"/>
    </condition>

  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.1" condition="HT32Fxxxx CMSIS">
      <description>System Startup for Holtek HT32 Family device</description>
      <files>
        <!--  include folder -->
        <file category="include" name="ARM/INC/Holtek/HT32F125x/"       condition="HT32F125x"/>
        <file category="include" name="ARM/INC/Holtek/HT32F175x_275x/"  condition="HT32F175x"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1xxxx/"      condition="HT32F1653_54"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1xxxx/"      condition="HT32F1655_56"/>
        <file category="include" name="ARM/INC/Holtek/HT32F5xxxx/"      condition="HT32F5xxxx"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1xxxx/"      condition="HT32F1xxxx"/>
        <file category="include" name="ARM/INC/Holtek/HT32F1xxxx/"      condition="HT32F5826"/>
        <file category="include" name="ARM/INC/Holtek/HT32F5xxxx/"      condition="HT32F0008"/>
        <file category="include" name="ARM/INC/Holtek/HT32F5xxxx/"      condition="HT32F0006"/>
        <file category="include" name="ARM/INC/Holtek/HT32F5xxxx/"      condition="HT32F65240"/>

        <!-- Flash Option Bytes templates -->
        <!--<file category="source" name="ARM/Startup/Holtek/ht32_op.s"                               attr="config"    condition="Compiler ARM" version="1.0.1" select="Flash Option Bytes Template"/>-->

        <!-- startup files -->
        <file category="source" name="ARM/Startup/Holtek/HT32F125x/startup_ht32f125x.s"           attr="config"    condition="HT32F125x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/startup_ht32f175x_275x.s" attr="config"    condition="HT32F175x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/startup_ht32f175x_275x.s" attr="config"    condition="HT32F2755" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/startup_ht32f165x.s"          attr="config"    condition="HT32F1653_54" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/startup_ht32f165x.s"          attr="config"    condition="HT32F1655_56" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52220_30.s"      attr="config"    condition="HT32F52220_30" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52231_41.s"      attr="config"    condition="HT32F52231_41" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52331_41.s"      attr="config"    condition="HT32F52331_41" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52342_52.s"      attr="config"    condition="HT32F52342_52" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52243_53.s"      attr="config"    condition="HT32F52243_53" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/startup_ht32f12345.s"         attr="config"    condition="HT32F12345" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/startup_ht32f12365_66.s"      attr="config"    condition="HT32F12365_66" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/startup_ht32f12365_66.s"      attr="config"    condition="HT32F22366" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f5826.s"          attr="config"    condition="HT32F5826" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f0008.s"          attr="config"    condition="HT32F0008" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f0006.s"          attr="config"    condition="HT32F0006" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f50220_30.s"      attr="config"    condition="HT32F50220_30" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f50231_41.s"      attr="config"    condition="HT32F50231_41" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52344_54.s"      attr="config"    condition="HT32F52344_54" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f65240.s"         attr="config"    condition="HT32F65240" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f52357_67.s"      attr="config"    condition="HT32F52357_67" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f57331_41.s"      attr="config"    condition="HT32F57331_41" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/startup_ht32f57342_52.s"      attr="config"    condition="HT32F57342_52" version="1.0.0"/>

        <!-- system file -->
        <file category="source" name="ARM/Startup/Holtek/HT32F125x/system_ht32f125x.c"            attr="config"    condition="HT32F125x" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/system_ht32f175x_275x.c"  attr="config"    condition="HT32F175x" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F175x_275x/system_ht32f175x_275x.c"  attr="config"    condition="HT32F2755" version="1.0.1"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/system_ht32f1xxxx_01.c"       attr="config"    condition="HT32F1653_54" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/system_ht32f1xxxx_01.c"       attr="config"    condition="HT32F1655_56" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_01.c"       attr="config"    condition="HT32F52331_41" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_01.c"       attr="config"    condition="HT32F52342_52" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_02.c"       attr="config"    condition="HT32F52220_30" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_02.c"       attr="config"    condition="HT32F52231_41" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_02.c"       attr="config"    condition="HT32F52243_53" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/system_ht32f1xxxx_02.c"       attr="config"    condition="HT32F12345" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/system_ht32f1xxxx_02.c"       attr="config"    condition="HT32F12365_66" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F1xxxx/system_ht32f1xxxx_02.c"       attr="config"    condition="HT32F22366" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5826.c"           attr="config"    condition="HT32F5826" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_03.c"       attr="config"    condition="HT32F0008" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f0006.c"           attr="config"    condition="HT32F0006" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_04.c"       attr="config"    condition="HT32F50220_30" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_04.c"       attr="config"    condition="HT32F50231_41" version="1.1.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_03.c"       attr="config"    condition="HT32F52344_54" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_03.c"       attr="config"    condition="HT32F65240" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_03.c"       attr="config"    condition="HT32F52357_67" version="1.2.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_05.c"       attr="config"    condition="HT32F57331_41" version="1.0.0"/>
        <file category="source" name="ARM/Startup/Holtek/HT32F5xxxx/system_ht32f5xxxx_05.c"       attr="config"    condition="HT32F57342_52" version="1.0.0"/>

