glcloud/keil_v5/ARM/PACK/.Web/Holtek.HT32_DFP.pdsc
        <!-- device configuration required by drivers at the moment -->
      </files>
    </component>
  </components>

  <boards>

    <board vendor="Holtek" name="ESK32-30105 (HT32F12366)" revision="Ver 2.3"
           orderForm="https://www.bestmodulescorp.com/esk32-30105.html">
      <description>Holtek ESK32-30105 HT32F12366 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30105.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30105" title="ESK32-30105 Starter Kit Web Page"/>
      <book category="schematic" name="https://www.holtek.com.tw/documents/10179/178484/ESK32-30105_Schematics_12366_SK_V2.3.zip" title="Schematics"/>
      <book category="manual"    name="https://www.holtek.com.tw/documents/10179/106680/HT32F5xxxx_StarterKitUserManuav100.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F12366"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F12365/12366/22366"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="80"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

    <board vendor="Holtek" name="ESK32-30501 (HT32F52352)" revision="Ver 2.0"
           orderForm="https://www.bestmodulescorp.com/esk32-30501.html">
      <description>Holtek ESK32-30501 HT32F52352 Starter Kit</description>
      <image large="http://mcu.holtek.com.tw/ht32/images/ESK32-30105.jpg"/>
      <book category="overview"  name="https://www.holtek.com/esk32-30501" title="ESK32-30501 Starter Kit Web Page"/>
      <book category="schematic" name="https://www.holtek.com/documents/10179/106680/ESK32-30501_Schematics_52352_SK_V2.0.zip" title="Schematics"/>
      <book category="manual"    name="https://www.holtek.com.tw/documents/10179/106680/HT32F5xxxx_StarterKitUserManuav100.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Holtek:106" Dname="HT32F52352"/>
      <compatibleDevice deviceIndex="0" Dvendor="Holtek:106" DsubFamily="HT32F52342/52352"/>
      <feature type="ODbg"            n="1"              name="On-board e-Link32 Pro (CMSIS-DAP)"/>
      <feature type="XTAL"            n="8000000"/>
      <feature type="PWR"             n="5"              name="USB Powered"/>
      <feature type="DIO"             n="51"             name="Digital I/Os (depending on configuration)"/>
      <feature type="USB"             n="1"              name="USB 2.0 Full-speed Device interface (USB Device connector)"/>
      <feature type="Button"          n="1"              name="Reset Button"/>
      <feature type="LED"             n="5"              name="(3.3 V Power, User I/O Port LEDs, Debug Adapter USB Ready/Busy"/>
      <feature type="CustomFF"        n="65" m="100"/>
      <debugInterface adapter="e-Link32 Pro" connector="Micro-USB"/>
      <debugInterface adapter="SWD" connector="10 pin Cortex debug (2.54 mm Connector)"/>
    </board>

  </boards>

  <examples>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30105_HT32F12366/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30105 (HT32F12366)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

    <example name="LED Blinky" doc="readme.txt" folder="ARM/Boards/Holtek/ESK32-30501_HT32F52352/LED_Blinky">
      <description>LED Blinky example</description>
      <board vendor="Holtek" name="ESK32-30501 (HT32F52352)"/>
      <project>
        <environment name="uv" load="MDK_ARMv5/Project.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>Holtek</category>
      </attributes>
    </example>

  </examples>

</package>
